ХМНПФ_Общее/Documents/уп_Распоряжение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_Распоряжение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еКоэф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПенсионногоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыПенсионныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВвода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормаВвода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еГрДож</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалитьуп_ТаблицыДожитий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>еМаксВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзменениеУсловийВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заявление</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновлятьВерсиюПравил</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныеОснования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВыплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазмерВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВзносыНаИПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИДНаУК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаСледующейПеререгистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоверенноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачальнаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПериодичностьВыплат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерМесяцаВПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончанияОснований</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВыделяемаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерОчереди</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФормаВыплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИДНаИПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаСчетаИсходная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВзносыНаУК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПерваяВылата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СправкаОбИнвалидности</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_СправкаОбИнвалидности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазмерПервойВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентПервойВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Единовременно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПоТребованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыПенсионныхСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыПенсионныхСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПожизненныхВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсчерпанияСредствНаСчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_Распоряжение/Forms/ФормаДокумента/Ext/Form/Module.bsl
// ХМНПФ+ 12.02.2019 ХлопцевБА // РасчитатьПервуюВыплату // №1498
&НаСервере
Процедура НПФ_РасчитатьПервуюВыплатуПередНаСервере()
	
	Дата = Объект.Дата;
	СписокСчетов = Объект.СписокСчетов;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.ПенсионнаяСхема КАК ПенсионнаяСхема,
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.ПорядокРасчета КАК ПорядокРасчета,
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ втВсе
	|ИЗ
	|	РегистрСведений.хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхеме.СрезПоследних(&КонПериода, ПенсионнаяСхема В (&мПенсионнаяСхема)) КАК хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втВсе.Период) КАК Период,
	|	втВсе.ПенсионнаяСхема КАК ПенсионнаяСхема
	|ПОМЕСТИТЬ втМаксимум
	|ИЗ
	|	втВсе КАК втВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	втВсе.ПенсионнаяСхема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсе.ПенсионнаяСхема КАК ПенсионнаяСхема,
	|	втВсе.ПорядокРасчета КАК ПорядокРасчета
	|ИЗ
	|	втВсе КАК втВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимум КАК втМаксимум
	|		ПО втВсе.ПенсионнаяСхема = втМаксимум.ПенсионнаяСхема
	|			И втВсе.Период = втМаксимум.Период";
	
	Запрос.УстановитьПараметр("КонПериода", Дата);
	Запрос.УстановитьПараметр("мПенсионнаяСхема", СписокСчетов.Выгрузить().ВыгрузитьКолонку("Схема"));
	
	тзСхемыРасчета = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из СписокСчетов Цикл
		
		ФизЛицо = Стр.Участник.уп_ФизЛицо;
		
		Процент   = Стр.ПроцентПервойВыплаты;
		РезервСКД = Стр.ВзносыНаИПС + Стр.ИДНаИПС;
		
		Если Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
			ПериодичностьВыплатЧисло = 1;
		ИначеЕсли Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
			ПериодичностьВыплатЧисло = 3;
		ИначеЕсли Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
			ПериодичностьВыплатЧисло = 12;
		КонецЕсли;
		ДатаРождения = ФизЛицо.ДатаРождения;
		Возраст = Цел((Дата - ДатаРождения)/(60*60*24*365));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Мужчины КАК Мужчины,
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Женщины КАК Женщины,
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Общий КАК Общий
		|ИЗ
		|	РегистрСведений.хм_КоэффициентРасчетаПожизненнойНПО.СрезПоследних(
		|			&КонПериода,
		|			Возраст = &Возраст
		|				И Доходность = 0) КАК хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних";
		
		Запрос.УстановитьПараметр("Возраст", Возраст);
		Запрос.УстановитьПараметр("КонПериода", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ФизЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				Коэфициент = ВыборкаДетальныеЗаписи.Мужчины;
			Иначе
				Коэфициент = ВыборкаДетальныеЗаписи.Женщины;
			КонецЕсли;
		КонецЦикла;
		
		нСтрока = тзСхемыРасчета.Найти(Стр.Схема,"ПенсионнаяСхема");	
		
		Если нСтрока <> Неопределено Тогда
			ПорядокРасчета = нСтрока.ПорядокРасчета;
		Иначе	
			ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013;
		КонецЕсли;	
		
		Если Стр.ПерваяВылата Тогда
			
			Если ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт14052001 Тогда
				
				Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
					
					Стр.РазмерПервойВыплаты = ((1-Процент/100)* РезервСКД / (ПериодичностьВыплатЧисло * Коэфициент)) +  ((Процент/100)* РезервСКД); 
					
				Иначе
					
					Стр.РазмерПервойВыплаты = ((1-Процент/100)* РезервСКД / Стр.КоличествоВыплат ) +  ((Процент/100)* РезервСКД); 
					
				КонецЕсли;	
				
				
			ИначеЕсли ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013 Тогда	
				
				Стр.РазмерПервойВыплаты = (Процент/100)* РезервСКД; 
				
			Иначе                        
				//Сообщить();
			КонецЕсли;	
			
		КонецЕсли;  //конец расчета первой выплаты 
		
		
		//Обычная выплата 
		Если ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт14052001 Тогда
			
			Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				
				
				Стр.РазмерВыплаты = ((1-Процент/100)* РезервСКД / (ПериодичностьВыплатЧисло * Коэфициент)); 
				
			Иначе // если не пожизненая 
				
				Стр.РазмерВыплаты = ((1-Процент/100)* РезервСКД / Стр.КоличествоВыплат ); 
				
			КонецЕсли;	
			
			
		ИначеЕсли ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013 Тогда	
			
			Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				
				Стр.РазмерВыплаты = (РезервСКД - Стр.РазмерПервойВыплаты)/(ПериодичностьВыплатЧисло * Коэфициент)
				
			Иначе // не пожизнена 
				
				Стр.РазмерВыплаты = (РезервСКД - Стр.РазмерПервойВыплаты)/(Стр.КоличествоВыплат -1);
				
			КонецЕсли;
		Иначе                        
			//Сообщить();
		КонецЕсли;
		
		//Иначе
		//	//Сообщить();
		//Конецесли;	
		
	КонецЦикла;
	
КонецПроцедуры
// ХМНПФ- 12.02.2019 ХлопцевБА // РасчитатьПервуюВыплату // №1498

&НаКлиенте
Процедура НПФ_РасчитатьПервуюВыплатуПеред(Команда)
	НПФ_РасчитатьПервуюВыплатуПередНаСервере();
КонецПроцедуры

&НаСервере
&После("РасчетСрочныхПенсийНаСервере")
Процедура НПФ_РасчетСрочныхПенсийНаСервере()
	
	Для каждого стр из Объект.СписокСчетов Цикл
		//округляем по тз ЮЦАУ
		стр.РазмерВыплаты = Цел(стр.РазмерВыплаты);
	КонецЦикла;	
	
КонецПроцедуры
